<template>
  <v-container
    :class="this.$route.path == '/about' ? 'homeContainer' : ''"
    style="margin-bottom: 50px;"
  >
    <div>
      <h2 v-if="this.$route.path == '/'">
        การท่องเที่ยวเชิงเกษตร หมายถึง
      </h2>
      <h1 style="font-size:24;" v-if="this.$route.path == '/about'">
        การท่องเที่ยวเชิงเกษตร หมายถึง
      </h1>
      <p class="paragraph mt-5">
        การท่องเที่ยวที่มุ่งเน้นทางด้านการเรียนรู้วิถีเกษตร กรรมของชาวชนบท
        โดยเน้นการมีส่วนร่วมของนักท่องเที่ยวในการดำเนินกิจกรรมให้เกิดการเรียนรู้ด้านการเกษตรและวิถีการดำรงชีวิต
        วัฒนธรรม ประเพณี
        และเป็นการนำเอาทรัพยากรที่มีอยู่ให้เกิดการเรียนรู้มาทำให้เกิดประโยชน์ก่อให้เกิดรายได้ต่อชุมชน
        และตัวเกษตรกร การท่องเที่ยวเชิงเกษตร
        จะเป็นการอนุรักษ์ควบคู่ไปกับการท่องเที่ยวเพื่อไม่ให้เกิดผลกระทบต่อชุมชนและผล
        กระทบต่อสภาพสิ่งแวดล้อม
      </p>
      <p class="paragraph">
        การท่องเที่ยวเชิงเกษตรเป็นการเดินทางท่องเที่ยวไปยังพื้นที่เกษตรกรรม
        สวนเกษตร วนเกษตร สวนสมุนไพร ฟาร์มปศุสัตว์และสัตว์เลี้ยง
        เพื่อชื่นชมความสวยงาม ความสำเร็จ และเพลิดเพลินในสวนเกษตร ได้ความรู้
        ได้ประสบการณ์ใหม่ บนพื้นฐานความรับผิดชอบ
        มีจิตสำนึกต่อการรักษาสภาพแวดล้อมของสถานที่แห่งนั้น
      </p>
      <div v-if="page != 'home'">
        <p class="paragraph">
          ในแหล่งท่องเที่ยวเชิงเกษตรแต่ละแห่งจะมีกิจกรรมที่จะให้บริการนักท่องเที่ยวหลาย
          ๆ กิจกรรม แล้วแต่สภาพจุดท่องเที่ยวเชิงเกษตรแต่ละแห่ง ได้แก่
        </p>
        <p class="paragraph">
          1.) ประเภทนักท่องเที่ยวร่วมกิจกรรมระยะสั้น ได้แก่ การเข้าชมสวนเกษตร
          โดยนักท่องเที่ยวอาจเก็บผลผลิตในสวนหรือซื้อผลผลิตโดยเลือกเก็บได้
          และทำกิจกรรมพื้นบ้านระยะสั้น ร่วมกับชาวบ้าน เช่น ขี่ควาย นั่งเกวียน
          และอื่น ๆ
        </p>
        <p class="paragraph">
          2.) ประเภทให้นักท่องเที่ยวพักแรมในหมู่บ้าน
          การให้นักท่องเที่ยวพักแรมในหมู่บ้านเพื่อศึกษา
          และสัมผัสกับชีวิตของชาวชนบทเกษตรโดยนักท่องเที่ยวจะได้รับบริการที่อบอุ่น
          ปลอดภัย สะดวกและสะอาด
        </p>
        <p class="paragraph">
          3.) ประเภทอบรมให้ความรู้เกษตรแผนใหม่และความรู้ที่เป็นภูมิปัญญาชาวบ้าน
          การทำการเกษตรแผนใหม่ เช่น การปลูกและการดูแลรักษา
          การแปรรูปผลผลิตทางการเกษตร อาจมีการให้ใบประกาศนียบัตรด้วย
          การเรียนรู้ภูมิปัญญาชาวบ้าน เช่น การศึกษาแมลงที่มีประโยชน์
          พืชผักพื้นเมืองที่กินได้ การทำน้ำตาลมะพร้าวและน้ำตาลโตนด ฯลฯ
        </p>
        <p class="paragraph">
          4.) ประเภทจำหน่ายสินค้าและผลิตภัณฑ์เกษตรสินค้าหัตถกรรมพื้นบ้านของเกษตร
          กร ของใช้และของที่ระลึกต่าง ๆ ผลไม้สด ดอกไม้สด
          เมล็ดพันธุ์พืชที่น่าสนใจให้นักท่องเที่ยวซื้อไปปลูก
        </p>
        <p class="paragraph">
          5.) ประเภทให้ลู่ทางธุรกิจ ช่วงที่ธุรกิจอื่น ๆ ประสบปัญหาจากธุรกิจตกต่ำ
          ให้นักท่องเที่ยวส่วนหนึ่งเดินทางมาท่องเที่ยวเพื่อหาลู่ทางในการทำธุรกิจเกี่ยวกับการเกษตร
          เพราะเป็นธุรกิจที่ให้ผลตอบแทนเร็ว
          การท่องเที่ยวในลักษณะนี้นอกจากจะช่วยเอื้อประโยชน์ให้แก่เกษตรกรแล้วยังเป็นหนทางที่ช่วยภาคเอกชนที่รับผลกระทบจากสภาวะเศรษฐกิจในปัจจุบันอีกด้วย
        </p>
        <div>
          <span class="blue--text">แหล่งที่มา:</span>
          https://sites.google.com/site/molljune54/khwam-hmay-kar-thxng-theiyw-cheing-kestr
        </div>
      </div>
    </div>
  </v-container>
</template>

<script>
export default {
  name: "About",
  props: ["page"],
};
</script>

<style></style>
